""" Задача 16: Требуется вычислить, сколько раз встречается
некоторое число X в массиве A[1..N]. Пользователь в первой строке
вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai.
Последняя строка содержит число X

*Пример:*
5
1 2 3 4 5
3
-> 1 """

n = int(input('количество элементов в массиве => '))
my_list = []
for i in range(n):
    my_list.append(int(input('=> ')))  # Считываем построчно массив A
x = int(input('Сколько раз встречается число => '))  # Считываем число X
count = 0
for i in range(n):
    if my_list[i] == x:
        count += 1
print('=> ' + str(count))
